Revit 2027 API
AlignmentStationLabel.Get Method
 Returns an AlignmentStationLabel object for the given element.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static AlignmentStationLabel Get(
	Element element
)
Public Shared Function Get (
	element As Element
) As AlignmentStationLabel
public:
static AlignmentStationLabel^ Get(
	Element^ element
)
static member Get :
        element : Element -> AlignmentStationLabel
Parameters
element Element
The element for which to return the object.
Return Value
AlignmentStationLabel
See Also
Reference
AlignmentStationLabel Class
Autodesk.Revit.DB.Infrastructure Namespace